qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
#define UUID16_EXTRACT(DST,SRC)                                                                  \
        do                                                                                       \
        {                                                                                        \
            (*(DST)) = (SRC)[1];                                                                 \
            (*(DST)) <<= 8;                                                                      \
            (*(DST)) |= (SRC)[0];                                                                \
        } while(0)

/**@brief Variable length data encapsulation in terms of length and pointer to data */
typedef struct
{
    uint8_t     * p_data;                                         /**< Pointer to data. */
    uint16_t      data_len;                                       /**< Length of data. */
}data_t;

/*****************************************************************************
* Asserts handling
*****************************************************************************/

/**@brief Callback handlers for SoftDevice and application asserts. 
 */
void softdevice_assert_callback(uint32_t pc, uint16_t line_num, const uint8_t *file_name);
void app_assert_callback(uint32_t line_num, const uint8_t *file_name);

#define LED_STEP_INTERVAL					APP_TIMER_TICKS(20, APP_TIMER_PRESCALER)
#define LED_STEP_SIZE						2
static app_timer_id_t led_dim_timer_id[4];
static uint8_t led_current[4] = {0};
static uint8_t led_target[4] = {0};
static uint8_t led_turning[4] = {0};
static uint8_t led_step_size[4] = {0};
static uint8_t led_step_cnt[4] = {0};
static uint8_t led_recalculate[4] = {0};
static uint8_t led_tag[4] = {0, 1, 2, 3};

static ble_memdump_t                            m_memdump;
static ble_led_t								m_led;
static ble_gap_scan_params_t                    m_scan_param;
uint8_t led_uuid_type = 0;

static const ble_gap_conn_params_t m_connection_param =
{
    (uint16_t)PERIPHERAL_AND_MIN_CONN_INTERVAL,     // Minimum connection
    (uint16_t)PERIPHERAL_AND_MAX_CONN_INTERVAL,     // Maximum connection
    (uint16_t)PERIPHERAL_AND_SLAVE_LATENCY,         // Slave latency
    (uint16_t)PERIPHERAL_AND_CONN_SUP_TIMEOUT       // Supervision time-out
};

/*****************************************************************************
* Functions and structures related to connection and buffers
*****************************************************************************/
#define DATA_BUFFER_SIZE                   12 /* Size of bufer that collects HTS data from one peripheral. */

#define TX_BUFFER_READY                    1 /* TX buffer empty. */
#define TX_BUFFER_BUSY                     0 /* TX buffer in use. */                               

static uint8_t gs_tx_buffer = TX_BUFFER_READY;

typedef struct {
    uint8_t next_entry_index;
    uint8_t value[DATA_BUFFER_SIZE];
} data_buffer_t;

typedef struct {
    uint16_t                conn_handle;
    uint16_t                descriptor_handle;
    data_buffer_t           data_buffer;
    ble_db_discovery_t      db_discovery;
    ble_hts_c_t             hts_c;
} peripheral_t;

peripheral_t gs_peripheral[NUMBER_OF_PERIPHERALS];

typedef struct
{
    uint16_t conn_handle;
    uint8_t  notification_enabled;
    uint8_t  cpu_request_done;
} central_t;

central_t gs_central;
static bool gs_advertising_is_running = false;

void led_set_light(uint8_t idx, uint8_t target)
{
	uint8_t delta;

	// Four LEDs
	if ((idx >= 4) || (led_turning[idx] != 0) || (target == led_current[idx])) {
		return;
	}

	led_target[idx] = target;
	if (target > led_current[idx]) {
		led_turning[idx] = 1;
		delta = target - led_current[idx];
	} else {
		led_turning[idx] = 0xFF;
		delta = led_current[idx] - target;
	}

#ifdef LED_STEP_SIZE
	if (delta <= LED_STEP_SIZE) {
		led_step_size[idx] = delta;
		led_step_cnt[idx] = 1;
	} else {
		led_step_size[idx] = LED_STEP_SIZE;
		led_step_cnt[idx] = delta / LED_STEP_SIZE;
		if (delta % LED_STEP_SIZE != 0) {
			led_step_cnt[idx]++;
		}
	}
	led_recalculate[idx] = 0;
#else
	if (delta <= 20) {
		led_step_size[idx] = 1;
		led_step_cnt[idx] = delta;
		led_recalculate[idx] = 0;
	} else {
		led_step_size[idx] = delta / 20;
		led_step_cnt[idx] = 20;
		led_recalculate[idx] = 1;
	}
#endif

	if (led_turning[idx] == 1) {
		led_current[idx] += led_step_size[idx];
		led_step_cnt[idx]--;
		if (led_recalculate[idx] != 0) {
			led_step_size[idx] = (led_target[idx] - led_current[idx]) / led_step_cnt[idx];
		}
	} else {
		led_current[idx] -= led_step_size[idx];
		led_step_cnt[idx]--;
		if (led_recalculate[idx] != 0) {
			led_step_size[idx] = (led_current[idx] - led_target[idx]) / led_step_cnt[idx];
		}
	}
	nrf_pwm_set_value(idx, led_current[idx]);

	if (led_step_cnt[idx] > 0) {
		app_timer_start(led_dim_timer_id[idx], LED_STEP_INTERVAL, &led_tag[idx]);
	} else {
		led_turning[idx] = 0;
	}
}

// Application error handler
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    NVIC_SystemReset();
}

// SoftDevice
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
	persistent_record_error(PERSISTENT_ERROR_DEADBEEF, (uint32_t)line_num);
	for(;;);
}

/**@brief Function resets buffer that keep data collected from peripheral.
 *
 * @param[in]   peripheral_id   Pointing the buffer of which periferal will be reset.
 *
 * @return
 * @retval      Error code: NRF_SUCCESS in case of success
 *                       or NRF_ERROR_INVALID_PARAM in case of providing peripheral_id from out of range.
*/
static uint8_t buffer_reset(uint16_t peripheral_id)
{
    uint8_t i = 0;

    if (peripheral_id < NUMBER_OF_PERIPHERALS)
    {
        gs_peripheral[peripheral_id].data_buffer.next_entry_index = 0;
        for (i = 0; i < DATA_BUFFER_SIZE; i++)
        {
            gs_peripheral[peripheral_id].data_buffer.value[i] = 0;
        }
        return NRF_SUCCESS;
    }
    return NRF_ERROR_INVALID_PARAM;
}


/**@brief Function counts average value of data collected in buffor for given peripheral.
 *
 * @param[in]   peripheral_id   Pointing peripheral to select buffer that should be used to cout the average .
 *
 * @return
 * @retval      Average value of data collected in buffer. In case of providing peripheral_id from out of range it returns 0.
*/
static uint8_t average_buffer_value(uint16_t peripheral_id)
{
    uint16_t sum        = 0;
    uint8_t  average    = 0;
    uint8_t  i          = 0;

    if (peripheral_id < NUMBER_OF_PERIPHERALS)
    {
        if (gs_peripheral[peripheral_id].data_buffer.next_entry_index > 0)
        {
            for (i = 0; i < gs_peripheral[peripheral_id].data_buffer.next_entry_index; i++)
            {
                sum += (uint8_t) gs_peripheral[peripheral_id].data_buffer.value[i];
            }
            average = (uint8_t) (sum / gs_peripheral[peripheral_id].data_buffer.next_entry_index);
        }
    }
    return average;
}

/**@brief Function adds value to the buffer for given peripheral.
 *
 * @param[in]   peripheral_id   Pointing peripheral to select buffer where the value shoudl be added.
 * @param[in]   value           Value to be placed in the buffer.
 *
 * @retval      Error code: NRF_SUCCESS in case of success
 *                       or NRF_ERROR_INVALID_PARAM in case of providing peripheral_id from out of range.
*/
static uint8_t buffer_add_value(uint16_t peripheral_id, uint8_t value)
{
    uint8_t i = 0;
    
    if (peripheral_id < NUMBER_OF_PERIPHERALS)
    {
        if (gs_peripheral[peripheral_id].data_buffer.next_entry_index >= DATA_BUFFER_SIZE)
        {
            for (i = 0; i < DATA_BUFFER_SIZE - 1; i++)
            {
                gs_peripheral[peripheral_id].data_buffer.value[i] = gs_peripheral[peripheral_id].data_buffer.value[i + 1];
            }
            gs_peripheral[peripheral_id].data_buffer.value[DATA_BUFFER_SIZE - 1] = value;
        }
        else
        {
            gs_peripheral[peripheral_id].data_buffer.value[gs_peripheral[peripheral_id].data_buffer.next_entry_index] = value;
            gs_peripheral[peripheral_id].data_buffer.next_entry_index++;
        }
        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_PARAM;
    }
}


/**@brief BLE related global variables used by functions.
*/
static ble_gatts_char_handles_t gs_own_char_handle;

#define INVALID_DESCRIPTOR_HANDLE 0

