qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
/**@brief Function resets structure that keep information about peer central.
*/
static void central_info_reset(void)
{
    memset((void*)&gs_central, 0, sizeof(central_t));
    gs_central.conn_handle          = BLE_CONN_HANDLE_INVALID;
    gs_central.notification_enabled = 0;
    gs_central.cpu_request_done  = 0;
    gs_tx_buffer = TX_BUFFER_READY;
}

/**@brief BLE related global variables used by functions.
*/
#define INVALID_DESCRIPTOR_HANDLE 0
#define ID_NOT_FOUND 0xFFFF

/**@brief Function resets structure that keep information about given peripherals.
 *
 * @param[in]   peripheral_id Peripherial id.
 *
 * @retval      NRF_SUCCESS if success or NRF_ERROR_INVALID_PARAM if peripheral_id out of rage
*/
static uint8_t peripheral_info_reset(uint16_t peripheral_id)
{
    if (peripheral_id < NUMBER_OF_PERIPHERALS)
    {
        memset((void*)&gs_peripheral[peripheral_id], 0, sizeof(peripheral_t));
        gs_peripheral[peripheral_id].conn_handle        = BLE_CONN_HANDLE_INVALID;
        gs_peripheral[peripheral_id].descriptor_handle = INVALID_DESCRIPTOR_HANDLE;

        return NRF_SUCCESS;
    }
    else
    {
        return NRF_ERROR_INVALID_PARAM;
    }
}

/**@brief Function resets structure that keep information about peer peripherals.
*/
static void peripherals_info_reset(void)
{
    uint16_t peripheral_id = ID_NOT_FOUND;
    
    for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
    {
        if (peripheral_info_reset(peripheral_id) == NRF_ERROR_INVALID_PARAM )
        {
            LOG_DEBUG("Peripheral information not reset - given invalid peripheral id (%i).", peripheral_id);
        }
    }
}

/**@brief Function provided reference to data structured for given connection handle.
 *
 * @param[in]   conn_handle Connection handle to be checked if it belongs to peer central.
 *
 * @retval      Id of peer peripheral or ID_NOT_FOUND if given connection handle does not belong to any peer peripheral.
*/
static uint16_t peripheral_id_get(uint16_t conn_handle)
{
    uint8_t i = 0;
    
    for (i = 0; i < NUMBER_OF_PERIPHERALS; i++)
    {
        if (conn_handle == gs_peripheral[i].conn_handle)
        {
            return i;
        }
    }
    return ID_NOT_FOUND;
}

// Get available peripheral ID
static uint16_t peripheral_get_available_id(void)
{
    uint8_t i = 0;
    
    for (i = 0; i < NUMBER_OF_PERIPHERALS; i++)
    {
        if (gs_peripheral[i].conn_handle == BLE_CONN_HANDLE_INVALID)
        {
            return i;
        }
    }
    return ID_NOT_FOUND;
}

ble_hts_c_t *peripheral_get_hts_c(uint16_t conn_handle)
{
    uint8_t i = 0;
    
    for (i = 0; i < NUMBER_OF_PERIPHERALS; i++)
    {
        if (gs_peripheral[i].conn_handle == conn_handle)
        {
            return &(gs_peripheral[i].hts_c);
        }
    }
    return NULL;
}

/**@brief Function checks if given connection handle comes from peer central.
 *
 * @param[in]   conn_handle Connection handle to be checked if it belongs to peer central.
 *
 * @retval      true or false
*/
bool is_central(uint16_t conn_handle)
{
    if (conn_handle == gs_central.conn_handle)
    {
        return true;
    }
    else
    {
        return false;
    }
}

/*****************************************************************************
* GAP events handling
*****************************************************************************/
#define EVENT_HANDLER_NONBLOCKING 0
//static __attribute__((aligned(4))) uint8_t gs_evt_buf[sizeof(ble_evt_t) + BLE_L2CAP_MTU_DEF];
//static ble_evt_t                       *gsp_ble_evt = (ble_evt_t *) gs_evt_buf;


/**@brief Function that handles BLE connect event for peer Central
 *
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static void connect_peer_central(ble_evt_t *p_ble_evt)
{
    if (gs_central.conn_handle == BLE_CONN_HANDLE_INVALID)
    {
        LOG_INFO("Central connected."); 
        gs_central.conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        gs_advertising_is_running = false;
    }
    else
    {
        LOG_INFO("Central already connected. Unrecognized connection."); 
    }
}

/**@brief Function that handles BLE disconnect event
 *
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static __INLINE void disconnect_event_handle(ble_evt_t *p_ble_evt)
{
    //uint16_t peripheral_id = ID_NOT_FOUND;

   LOG_DEBUG("BLE_GAP_EVT_DISCONNECTED (0x%x) from connection handle 0x%x.", p_ble_evt->header.evt_id, p_ble_evt->evt.gap_evt.conn_handle);

}

/**@brief Function that handles BLE write event
 *
 * @param[in]   peripheral_id    Id of peripheral for handling this event.
 * @param[in]   p_ble_evt        Pointer to buffer filled in with an event.
*/
static __INLINE void write_event_handle(ble_evt_t *p_ble_evt)
{
    uint16_t write_event_value_handle = 0;
    uint8_t  write_data               = 0;

    write_event_value_handle = p_ble_evt->evt.gatts_evt.params.write.context.value_handle;
    write_data = p_ble_evt->evt.gatts_evt.params.write.data[0];
    /* Verify write event */
    if (write_event_value_handle != gs_own_char_handle.value_handle)
    {
        LOG_DEBUG("BLE_GATTS_EVT_WRITE handle value 0x%x != 0x%x", write_event_value_handle, gs_own_char_handle.value_handle);
        return;
    }
    if ((write_data != WRITE_VALUE_ENABLE_NOTIFICATIONS) && (write_data != WRITE_VALUE_DISABLE_NOTIFICATIONS))
    {
        LOG_INFO("Central sent improper value.");
        LOG_DEBUG("BLE_GATTS_EVT_WRITE data 0x%x out of range {0x01,0x00}", write_data, BLE_GATTS_ATTR_TYPE_DESC);
        return;
    }
    if (write_data == WRITE_VALUE_ENABLE_NOTIFICATIONS)
    {
        ble_gap_conn_params_t new_conn_params = {0};
        
        gs_central.notification_enabled = 1;
        LOG_INFO("Sending notifications enabled.");

        if (!gs_central.cpu_request_done)
        {
            uint32_t error_code = NRF_ERROR_NOT_FOUND;
            
            /* Request change of connection parameters to peer central. */
            new_conn_params.min_conn_interval = CENTRAL_MIN_CONN_INTERVAL;
            new_conn_params.max_conn_interval = CENTRAL_MAX_CONN_INTERVAL;
            new_conn_params.slave_latency     = CENTRAL_SLAVE_LATENCY;
            new_conn_params.conn_sup_timeout  = CENTRAL_CONN_SUP_TIMEOUT;
            if ((error_code = sd_ble_gap_conn_param_update(gs_central.conn_handle, &new_conn_params)) != NRF_SUCCESS)
            {
                LOG_DEBUG("(Central) Updating connection parameters failed - error code = 0x%x", error_code);
            }
            gs_central.cpu_request_done = 1; /* Already requested. */
        }
    }
    else if (write_data == WRITE_VALUE_DISABLE_NOTIFICATIONS)
    {
        gs_central.notification_enabled = 0;
        LOG_INFO("Sending notifications disabled.");
    }
}

// LED dimmer
static void led_dim_timeout_handler(void * p_context)
{
	uint8_t idx;

	idx = *(uint8_t *)p_context;

	if (led_step_cnt[idx] > 1) {
		if (led_turning[idx] == 1) {
			led_current[idx] += led_step_size[idx];
			led_step_cnt[idx]--;
			if (led_recalculate[idx] != 0) {
				led_step_size[idx] = (led_target[idx] - led_current[idx]) / led_step_cnt[idx];
			}
		} else {
			led_current[idx] -= led_step_size[idx];
			led_step_cnt[idx]--;
			if (led_recalculate[idx] != 0) {
				led_step_size[idx] = (led_current[idx] - led_target[idx]) / led_step_cnt[idx];
			}
		}
		nrf_pwm_set_value(idx, led_current[idx]);
		app_timer_start(led_dim_timer_id[idx], LED_STEP_INTERVAL, &led_tag[idx]);
	} else {
		led_current[idx] = led_target[idx];
		led_step_cnt[idx] = 0;
		led_turning[idx] = 0;
		nrf_pwm_set_value(idx, led_target[idx]);
	}
}

/**@brief Function that handles BLE events
 *        It handles the events that comes in given time. That evoids skipping events that should be handled and are not handled in calling function.
 *        In case when expected event appears or getting timeout it returns that to calling function to be processed there.
 *
 * @param[in]   expected_event   Expected event.
 * @param[in]   timeout_ms       Timeout for waiting for expected event.
 * @param[in]   p_evt_buf        Pointer to buffer to be filled in with an event, or NULL to retrieve the event length. This buffer must be 4-byte aligned in memory.
 * @param[in]   evt_buf_len      The length of the buffer, on return it is filled with the event length.
 *
 * @return
 * @retval      NRF_SUCCESS Event pulled and stored into the supplied buffer.
 * @retval      NRF_ERROR_INVALID_ADDR Invalid or not sufficiently aligned pointer supplied.
 * @retval      NRF_ERROR_NOT_FOUND No events ready to be pulled.
 * @retval      NRF_ERROR_DATA_SIZE Event ready but could not fit into the supplied buffer.
*/
#if 0
uint32_t event_handle(uint8_t expected_event, uint32_t timeout_ms, uint8_t *p_evt_buf, uint16_t evt_buf_len)
{
    uint16_t  evt_len       = 0;
    ble_evt_t *p_ble_evt    = (ble_evt_t *) p_evt_buf;
    uint32_t  error_code    = NRF_ERROR_NOT_FOUND;
    uint16_t  peripheral_id = ID_NOT_FOUND;

    if (timeout_ms != EVENT_HANDLER_NONBLOCKING) 
    {
    	scheduler_flag = 0;
    	app_timer_start(scheduler_timer_id, timeout_ms, NULL);
    }
    
    do
    {
        evt_len = evt_buf_len;
        error_code = sd_ble_evt_get(p_evt_buf, &evt_len);
            
        if (error_code == NRF_SUCCESS)
        {
            /*Catching expected event*/
            if (expected_event == p_ble_evt->header.evt_id)
            {
                return NRF_SUCCESS;
            }
            
            /*Event handler*/

            switch (p_ble_evt->header.evt_id)
            {
                case BLE_GAP_EVT_TIMEOUT:
                    if (gsp_ble_evt->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_ADVERTISING)
                    {
                        gs_advertising_is_running = false;

                        LOG_INFO("Advertisement stopped.");
                        if ((error_code = advertise()) != NRF_SUCCESS)
                        {
                            LOG_DEBUG("Restarting advertisement failed - error code = 0x%x", error_code);
                            LOG_INFO("Restarting advertisement failed.");
                        }
                    }
                break;
                case BLE_GAP_EVT_CONNECTED:
                    /*Expected connection from peer central, peer peripherals are handled in connect()*/
                    if(p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_PERIPH) //If this side is BLE_GAP_ROLE_PERIPH then BLE_GAP_EVT_CONNECTED comes from peer central
                    {
                        connect_peer_central(p_ble_evt);
                    }
                    else if(p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_CENTRAL) //If this side is BLE_GAP_ROLE_CENTRAL then BLE_GAP_EVT_CONNECTED comes from peer peropheral
                    {
                        //Disconnecting peripheral
                        if ((error_code = sd_ble_gap_disconnect(p_ble_evt->evt.gap_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION)) != NRF_SUCCESS)
                        {
                            LOG_INFO("Disconnection of non-central failed.");
                            LOG_DEBUG("Disconnecting failed for conn handle = 0x%x, error - code = 0x%x", p_ble_evt->evt.gap_evt.conn_handle, error_code);
                        }
                        else
                        {
                            LOG_DEBUG("Disconnected for conn handle = 0x%x", p_ble_evt->evt.gap_evt.conn_handle);
                        }
                    }
                break;
                case BLE_GAP_EVT_DISCONNECTED:
                    disconnect_event_handle(p_ble_evt);
                    break;
                case BLE_GATTS_EVT_WRITE:
                    write_event_handle(p_ble_evt);
                    break;
                case BLE_EVT_TX_COMPLETE:
                    gs_tx_buffer = TX_BUFFER_READY;
                    break;
                case BLE_GATTS_EVT_SYS_ATTR_MISSING:
                    sd_ble_gatts_sys_attr_set(p_ble_evt->evt.gatts_evt.conn_handle, NULL, 0);
                    break;
                case BLE_GATTC_EVT_HVX:
                    /*Handled in main loop - in do_work()*/
                    break;
                case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
                    if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gap_evt.conn_handle)) != ID_NOT_FOUND )
                    {
                        ble_gap_conn_params_t conn_params;
                        memcpy(&conn_params, &p_ble_evt->evt.gap_evt.params.conn_param_update_request.conn_params, sizeof(ble_gap_conn_params_t));
                        if ((error_code = sd_ble_gap_conn_param_update(gs_peripheral[peripheral_id].conn_handle, &conn_params)) == NRF_SUCCESS)
                        {
                            LOG_INFO("(Peripheral %i) Requests to change connection parameters (timeout = 0x%x, min conn. interval = 0x%x, max conn. interval = 0x%x, latency = 0x%x).", peripheral_id, conn_params.conn_sup_timeout, conn_params.min_conn_interval, conn_params.max_conn_interval, conn_params.slave_latency);
                        }
                        else
                        {
                            LOG_DEBUG("(Peripheral %i) Updating connection parameters failed - error code = 0x%x", peripheral_id, error_code);
                        }
                    }
                    break;
                case BLE_GAP_EVT_CONN_PARAM_UPDATE:
                    if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gap_evt.conn_handle)) != ID_NOT_FOUND )
                    {
                        LOG_INFO("(Peripheral %i) Connection parameters updated.", peripheral_id);
                    }
                    break;
                case BLE_GATTC_EVT_WRITE_RSP:
                    if ((peripheral_id = peripheral_id_get(p_ble_evt->evt.gattc_evt.conn_handle)) != ID_NOT_FOUND )
                    {
                        LOG_DEBUG("(Peripheral %i) Write confirmed", peripheral_id);
                        LOG_INFO("(Peripheral %i) CCCD update confirmed.", peripheral_id);
                    }
                    break;
                case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
                    LOG_INFO("Pairing not supported.");
                    if ((error_code = sd_ble_gap_sec_params_reply(p_ble_evt->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL)) != NRF_SUCCESS)
                    {
                       LOG_DEBUG("(Central) sd_ble_gap_sec_params_reply() error code 0x%x", error_code);
                    }
                    break;
                case BLE_GAP_EVT_AUTH_STATUS:
                    if(p_ble_evt->evt.gap_evt.params.auth_status.auth_status != BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP)
                    {
                        LOG_DEBUG("BLE_GAP_EVT_AUTH_STATUS = 0x%x", p_ble_evt->evt.gap_evt.params.auth_status.auth_status);
                    }
                    break;
                default:
                    LOG_DEBUG("Unhandled event: header: 0x%x", p_ble_evt->header.evt_id);
                    break;
            }
        }
        if (timeout_ms == EVENT_HANDLER_NONBLOCKING) /* No event received, abort */
        {
            return error_code;
        }
        if (NRF_ERROR_NOT_FOUND == error_code) /* No event received, continue */
        {
            sd_app_evt_wait(); 
            sd_nvic_ClearPendingIRQ(SD_EVT_IRQn);
            continue;
        }
        if (error_code != NRF_SUCCESS)
        {
            return error_code;
        }
    } while (scheduler_flag == 0);
 
    return NRF_ERROR_NOT_FOUND;
}
#endif

/*****************************************************************************
* Functions related to service setup, advertisement, discovery, device connection
*****************************************************************************/
/**@brief Function steup own service to be used to notify average values to peer central.
 *
 * Function does not return error code. If any internal call failes it triggers APP_ASSERT.
*/
static void services_init(void)
{
    APP_ERROR_CHECK(ble_memdump_init(&m_memdump));
    APP_ERROR_CHECK(ble_led_init(&m_led));
}

/**@brief Function connects to given peer peripheral.
 *
 * @param[in]   peripheral_id   Peripheral to be cannected.
 *
 * @return
 * @retval      NRF_SUCCESS if connected, otherwise NRF error code.
*/
#if 0
static uint32_t connect(uint16_t peripheral_id)
{
    uint32_t              error_code  = NRF_ERROR_NOT_FOUND;
    ble_gap_scan_params_t scan_params = {0};
    ble_gap_conn_params_t conn_params = {0};
    
    scan_params.selective         = 0;
    scan_params.active            = 0x01; /* Active scanning */
    scan_params.interval          = SCAN_INTERVAL;
    scan_params.window            = SCAN_WINDOW;
    scan_params.timeout           = SCAN_TIMEOUT;

    conn_params.min_conn_interval = PERIPHERAL_MIN_CONN_INTERVAL;
    conn_params.max_conn_interval = PERIPHERAL_MAX_CONN_INTERVAL;
    conn_params.slave_latency     = PERIPHERAL_SLAVE_LATENCY;
    conn_params.conn_sup_timeout  = PERIPHERAL_CONN_SUP_TIMEOUT;

