qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
    /* Descriptor discovery */
    do
    {
        if ((error_code = sd_ble_gattc_descriptors_discover(gs_peripheral[peripheral_id].conn_handle, &handle_range)) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Descriptor discovery: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if ((error_code = event_handle(BLE_GATTC_EVT_DESC_DISC_RSP, 2000, gs_evt_buf, sizeof(gs_evt_buf))) != NRF_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Descriptor discovery response: error code 0x%x", peripheral_id, error_code);
            return error_code;
        }
        if (gsp_ble_evt->evt.gattc_evt.gatt_status != BLE_GATT_STATUS_SUCCESS)
        {
            LOG_DEBUG("(Peripheral %i) Descriptor discovery response error code 0x%x", peripheral_id, error_code);
            return NRF_ERROR_NOT_FOUND;
        }
        for (i = 0; i < gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.count; i++)
        {
            if ((gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.uuid == HEART_RATE_SERVICE_DESCRIPTOR)
                && (gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.type == BLE_UUID_TYPE_BLE))
            {
                LOG_DEBUG("Descriptor found UUID 0x%04X", gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.uuid);
                /* Heart Rate Service handle found */
                gs_peripheral[peripheral_id].descriptor_handle = gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[i].handle;
                break;
            }
        }
        if (gs_peripheral[peripheral_id].descriptor_handle == 0)
        {
            handle_range.start_handle = gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.descs[gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.count - 1].handle + 1;
        }
    } while ((gs_peripheral[peripheral_id].descriptor_handle == INVALID_DESCRIPTOR_HANDLE) && (gsp_ble_evt->evt.gattc_evt.params.desc_disc_rsp.count > 0));
    if (gs_peripheral[peripheral_id].descriptor_handle == INVALID_DESCRIPTOR_HANDLE)
    {
        LOG_DEBUG("(Peripheral %i) Descriptor not found", peripheral_id);
        return NRF_ERROR_NOT_FOUND;
    }
    return error_code;
}


/**@brief Function writes cccd to get notification from given peer peripheral.
 *
 * @param[in]   peripheral_id   Peripheral id.
 *
 * @return
 * @retval      NRF_SUCCESS if discovery done without NRF errors
 *              otherwise NRF error code.
*/
static uint32_t notifications_enable(uint16_t peripheral_id)
{
    uint32_t                 error_code   = NRF_ERROR_NOT_FOUND;
    ble_gattc_write_params_t write_params = {0};
    uint16_t                 write_value  = WRITE_VALUE_ENABLE_NOTIFICATIONS;

    /* Central writes to CCCD of peripheral to receive indications */
    write_params.write_op = BLE_GATT_OP_WRITE_REQ;
    write_params.handle = gs_peripheral[peripheral_id].descriptor_handle;
    write_params.offset = 0;
    write_params.len = sizeof(write_value);
    write_params.p_value = (uint8_t *)&write_value;

    LOG_DEBUG("(Peripheral %i) Writing CCCD", peripheral_id);
    if ((error_code = sd_ble_gattc_write(gs_peripheral[peripheral_id].conn_handle, &write_params)) != NRF_SUCCESS)
    {
        LOG_DEBUG("(Peripheral %i) Writing CCCD: error code 0x%x", peripheral_id, error_code);
        return error_code;
    }
    return error_code;
}

/*****************************************************************************
* MAIN LOOP
*****************************************************************************/

/**@brief Main function that hadle key pressing, collecting data and sending notifications.
*/
static void do_work(void)
{
    uint32_t error_code    = NRF_ERROR_NOT_FOUND;
    uint16_t  peripheral_id = ID_NOT_FOUND;
    uint8_t  i             = 0;

    uint8_t  buffered_values_average[NUMBER_OF_PERIPHERALS] = {0};
    uint16_t data_size                                      = sizeof(buffered_values_average);

    for (;;)
    {
        if (!nrf_gpio_pin_read(BUTTON_0))
        {
            error_code = NRF_SUCCESS;
            //If no connection to peer central (advertisement in progress) stop advertising before connecting to peer peripherals.
            if (gs_advertising_is_running)
            {
                if ((error_code = sd_ble_gap_adv_stop()) == NRF_SUCCESS)
                {
                    LOG_INFO("Advertisement stopped.");
                    gs_advertising_is_running = false;
                }
                else
                {
                    LOG_DEBUG("sd_ble_gap_adv_stop() error code 0x%x (is adv on? 0x%x)", error_code, gs_advertising_is_running);
                }
            }
            //Connect to all unconnected peripherals.
            if(error_code == NRF_SUCCESS)
            {
                for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
                {
                    if (gs_peripheral[peripheral_id].conn_handle == BLE_CONN_HANDLE_INVALID)
                    {
                        if (connect(peripheral_id) == NRF_SUCCESS)
                        {
                            if ((discovery(peripheral_id) == NRF_SUCCESS) && (gs_peripheral[peripheral_id].descriptor_handle != INVALID_DESCRIPTOR_HANDLE))
                            {
                                if ((error_code = notifications_enable(peripheral_id))!= NRF_SUCCESS)
                                {
                                    LOG_DEBUG("(Peripheral %i) Enablig notifications (writting CCCD) failed - error code 0x%x ", error_code);
                                }
                                if ((error_code = buffer_reset(peripheral_id)) == NRF_ERROR_INVALID_PARAM )
                                {
                                    LOG_DEBUG("Buffer reset failed - given invalid peripheral id (%i).", peripheral_id);
                                }
                            }
                            else
                            {
                                LOG_INFO("(Peripheral %i) Service not found. Disconnecting.", peripheral_id);
                                if ((error_code = sd_ble_gap_disconnect(gs_peripheral[peripheral_id].conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION)) != NRF_SUCCESS)
                                {
                                    LOG_INFO("(Peripheral %i) Disconnection failed.", peripheral_id);
                                    LOG_DEBUG("(Peripheral %i) Disconnecting failed, error - code = 0x%x", peripheral_id, error_code);
                                }
                                else
                                {
                                    LOG_INFO("(Peripheral %i) Disconnected.", peripheral_id);
                                }
                            }
                        }
                    }
                    else
                    {
                        LOG_DEBUG("Peripheral 0x%x handle 0x%x - reconnecting skipped.", peripheral_id, gs_peripheral[peripheral_id].conn_handle);
                    }                        
                }
            }

