qodome/Firmware/iQo/IQ14BLW/nrf51/iQoApp/main.c
        }
        if (!nrf_gpio_pin_read(BUTTON_1))
        {
            for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
            {
                uint8_t average = average_buffer_value(peripheral_id);
                
                _LOG_INFO("[Peripheral %i] %i values in buffer:", peripheral_id, gs_peripheral[peripheral_id].data_buffer.next_entry_index);
                for (i = 0; i < DATA_BUFFER_SIZE; i++)
                {
                    _LOG_INFO(" %i,", (uint8_t) gs_peripheral[peripheral_id].data_buffer.value[i]);
                }
                LOG_INFO(" average value (of %i) = %i (0x%x)", gs_peripheral[peripheral_id].data_buffer.next_entry_index, average, average);
            }
            LOG_INFO("Connection status:");
            LOG_INFO("(Central) connection handle = 0x%x", gs_central.conn_handle);
            for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
            {
                LOG_INFO("(Peripheral %i) connection handle = 0x%x", peripheral_id, gs_peripheral[peripheral_id].conn_handle);
            }
        }

        if (!nrf_gpio_pin_read(BUTTON_0)&&!nrf_gpio_pin_read(BUTTON_1))
        {
            LOG_INFO("Button 0 and button 1 pressed simultaneously.");
            scheduler_flag = 0;
            app_timer_start(scheduler_timer_id, 1000, NULL);
            while (scheduler_flag == 0) {};
            LOG_INFO("Calling system reset...");
            NVIC_SystemReset();
        }

        error_code = event_handle(BLE_GATTC_EVT_HVX, 200, gs_evt_buf, sizeof(gs_evt_buf));
        if ((error_code == NRF_SUCCESS) && (gsp_ble_evt->header.evt_id == BLE_GATTC_EVT_HVX))
        {
            if ((peripheral_id = peripheral_id_get(gsp_ble_evt->evt.gattc_evt.conn_handle)) != ID_NOT_FOUND )
            {
                if (gsp_ble_evt->evt.gattc_evt.params.hvx.type == BLE_GATT_HVX_NOTIFICATION)
                {
                    if (gsp_ble_evt->evt.gattc_evt.params.hvx.len == 2)
                    {
                        if ((error_code = buffer_add_value(peripheral_id, gsp_ble_evt->evt.gattc_evt.params.hvx.data[1])) == NRF_ERROR_INVALID_PARAM )
                        {
                            LOG_DEBUG("Value not added to the buffer - given invalid peripheral id (%i).", peripheral_id);
                        }
                    }
                }
            }
            else
            {
                LOG_DEBUG("HVX from unknown device (conn handle: %i)", gsp_ble_evt->evt.gattc_evt.conn_handle);
            }
        }
        if (gs_central.notification_enabled && (gs_central.conn_handle != BLE_CONN_HANDLE_INVALID))
        {
            ble_gatts_hvx_params_t hvx_params;
            if (gs_tx_buffer == TX_BUFFER_READY)
            {
                for (peripheral_id = 0; peripheral_id < NUMBER_OF_PERIPHERALS; peripheral_id++)
                {
                    buffered_values_average[peripheral_id] = average_buffer_value(peripheral_id);
                }
                hvx_params.handle = gs_own_char_handle.value_handle;
                hvx_params.type = BLE_GATT_HVX_NOTIFICATION;
                hvx_params.offset = 0;
                hvx_params.p_len = &data_size;
                hvx_params.p_data = buffered_values_average;
                error_code = sd_ble_gatts_hvx(gs_central.conn_handle, &hvx_params);
                if ((error_code != NRF_SUCCESS) && (error_code != NRF_ERROR_INVALID_STATE)) /* NRF_ERROR_INVALID_STATE can be triggered when central has sent disconect meanwhile. */
                {
                    LOG_DEBUG("sd_ble_gatts_hvx() error code 0x%x central.conn_handle 0x%x", error_code, gs_central.conn_handle);
                }
                gs_tx_buffer = TX_BUFFER_BUSY;
            }
        }
        //If no connection to peer central re-start advertising.
        if ((!gs_advertising_is_running) && (gs_central.conn_handle == BLE_CONN_HANDLE_INVALID))
        {
            if ((error_code = advertise()) != NRF_SUCCESS)
            {
                LOG_DEBUG("Restarting advertisement failed - error code = 0x%x", error_code);
                LOG_INFO("Restarting advertisement failed.");
            }
        }
        
    }    
}
#endif

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */
static void timers_init(void)
{
	uint8_t idx;

    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, false);

    for (idx = 0; idx < 4; idx++) {
    	APP_ERROR_CHECK(app_timer_create(&(led_dim_timer_id[idx]), APP_TIMER_MODE_SINGLE_SHOT, led_dim_timeout_handler));
    }
}

static uint32_t adv_report_parse(uint8_t type, data_t * p_advdata, data_t * p_typedata)
{
    uint32_t index = 0;
    uint8_t * p_data;

    p_data = p_advdata->p_data;

    while (index < p_advdata->data_len)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type = p_data[index+1];

        if (field_type == type)
        {
            p_typedata->p_data = &p_data[index+2];
            p_typedata->data_len = field_length-1;
            return NRF_SUCCESS;
        }
        index += field_length+1;
    }
    return NRF_ERROR_NOT_FOUND;
}

static void hts_c_evt_handler(ble_hts_c_t * p_hts_c, ble_hts_c_evt_t * p_hts_c_evt)
{
    uint32_t err_code;

    switch (p_hts_c_evt->evt_type)
    {
        case BLE_HTS_C_EVT_DISCOVERY_COMPLETE:
            // Health Therometer Service discovered. Enable notification of Heart Rate Measurement.
            err_code = ble_hts_c_tm_idct_enable(p_hts_c);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_HTS_C_EVT_TM_INDICATION:
        {
            LOG_INFO("indication received");
            break;
        }
        default:
            break;
    }
}

static void hts_c_init(uint16_t conn_handle)
{
    ble_hts_c_init_t hts_c_init_obj;
    uint16_t peripheral_id = peripheral_id_get(conn_handle);

    hts_c_init_obj.evt_handler = hts_c_evt_handler;

    uint32_t err_code = ble_hts_c_init(conn_handle, 
                                        (peripheral_id == ID_NOT_FOUND) ? NULL : &(gs_peripheral[peripheral_id].hts_c), 
                                        &hts_c_init_obj);
    APP_ERROR_CHECK(err_code);
}

static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    data_t adv_data;
    data_t type_data;
    uint32_t err_code = NRF_SUCCESS;
    uint16_t peripheral_id = 0;
    const ble_gap_evt_t   * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
            LOG_INFO("BLE_GAP_EVT_ADV_REPORT");

            // Initialize advertisement report for parsing.
            adv_data.p_data = (uint8_t *)p_gap_evt->params.adv_report.data;
            adv_data.data_len = p_gap_evt->params.adv_report.dlen;

            err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE,
                                        &adv_data,
                                        &type_data);
            if (err_code != NRF_SUCCESS)
            {
                // Compare short local name in case complete name does not match.
                err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE,
                                            &adv_data,
                                            &type_data);
            }

            // Verify if short or complete name matches target.
            if (err_code == NRF_SUCCESS)
            {
                uint16_t extracted_uuid;

                // UUIDs found, look for matching UUID
                for (uint32_t u_index = 0; u_index < (type_data.data_len/UUID16_SIZE); u_index++)
                {
                    UUID16_EXTRACT(&extracted_uuid,&type_data.p_data[u_index * UUID16_SIZE]);

